garyPenhook/PIC-Assembler/device_includes/pic16f17556.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 009Ah
// bitfield definitions
PIE4_NCO1IE_POSN                         equ 0000h
PIE4_NCO1IE_POSITION                     equ 0000h
PIE4_NCO1IE_SIZE                         equ 0001h
PIE4_NCO1IE_LENGTH                       equ 0001h
PIE4_NCO1IE_MASK                         equ 0001h
PIE4_CWG1IE_POSN                         equ 0001h
PIE4_CWG1IE_POSITION                     equ 0001h
PIE4_CWG1IE_SIZE                         equ 0001h
PIE4_CWG1IE_LENGTH                       equ 0001h
PIE4_CWG1IE_MASK                         equ 0002h
PIE4_CLC1IE_POSN                         equ 0002h
PIE4_CLC1IE_POSITION                     equ 0002h
PIE4_CLC1IE_SIZE                         equ 0001h
PIE4_CLC1IE_LENGTH                       equ 0001h
PIE4_CLC1IE_MASK                         equ 0004h
PIE4_CLC2IE_POSN                         equ 0003h
PIE4_CLC2IE_POSITION                     equ 0003h
PIE4_CLC2IE_SIZE                         equ 0001h
PIE4_CLC2IE_LENGTH                       equ 0001h
PIE4_CLC2IE_MASK                         equ 0008h
PIE4_CLC3IE_POSN                         equ 0004h
PIE4_CLC3IE_POSITION                     equ 0004h
PIE4_CLC3IE_SIZE                         equ 0001h
PIE4_CLC3IE_LENGTH                       equ 0001h
PIE4_CLC3IE_MASK                         equ 0010h
PIE4_CLC4IE_POSN                         equ 0005h
PIE4_CLC4IE_POSITION                     equ 0005h
PIE4_CLC4IE_SIZE                         equ 0001h
PIE4_CLC4IE_LENGTH                       equ 0001h
PIE4_CLC4IE_MASK                         equ 0020h
PIE4_TX1IE_POSN                          equ 0006h
PIE4_TX1IE_POSITION                      equ 0006h
PIE4_TX1IE_SIZE                          equ 0001h
PIE4_TX1IE_LENGTH                        equ 0001h
PIE4_TX1IE_MASK                          equ 0040h
PIE4_RC1IE_POSN                          equ 0007h
PIE4_RC1IE_POSITION                      equ 0007h
PIE4_RC1IE_SIZE                          equ 0001h
PIE4_RC1IE_LENGTH                        equ 0001h
PIE4_RC1IE_MASK                          equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 009Bh
// bitfield definitions
PIE5_TX2IE_POSN                          equ 0000h
PIE5_TX2IE_POSITION                      equ 0000h
PIE5_TX2IE_SIZE                          equ 0001h
PIE5_TX2IE_LENGTH                        equ 0001h
PIE5_TX2IE_MASK                          equ 0001h
PIE5_RC2IE_POSN                          equ 0001h
PIE5_RC2IE_POSITION                      equ 0001h
PIE5_RC2IE_SIZE                          equ 0001h
PIE5_RC2IE_LENGTH                        equ 0001h
PIE5_RC2IE_MASK                          equ 0002h
PIE5_SSP1IE_POSN                         equ 0002h
PIE5_SSP1IE_POSITION                     equ 0002h
PIE5_SSP1IE_SIZE                         equ 0001h
PIE5_SSP1IE_LENGTH                       equ 0001h
PIE5_SSP1IE_MASK                         equ 0004h
PIE5_BCL1IE_POSN                         equ 0003h
PIE5_BCL1IE_POSITION                     equ 0003h
PIE5_BCL1IE_SIZE                         equ 0001h
PIE5_BCL1IE_LENGTH                       equ 0001h
PIE5_BCL1IE_MASK                         equ 0008h
PIE5_SSP2IE_POSN                         equ 0004h
PIE5_SSP2IE_POSITION                     equ 0004h
PIE5_SSP2IE_SIZE                         equ 0001h
PIE5_SSP2IE_LENGTH                       equ 0001h
PIE5_SSP2IE_MASK                         equ 0010h
PIE5_BCL2IE_POSN                         equ 0005h
PIE5_BCL2IE_POSITION                     equ 0005h
PIE5_BCL2IE_SIZE                         equ 0001h
PIE5_BCL2IE_LENGTH                       equ 0001h
PIE5_BCL2IE_MASK                         equ 0020h
PIE5_CM1IE_POSN                          equ 0006h
PIE5_CM1IE_POSITION                      equ 0006h
PIE5_CM1IE_SIZE                          equ 0001h
PIE5_CM1IE_LENGTH                        equ 0001h
PIE5_CM1IE_MASK                          equ 0040h
PIE5_CMLP1IE_POSN                        equ 0007h
PIE5_CMLP1IE_POSITION                    equ 0007h
PIE5_CMLP1IE_SIZE                        equ 0001h
PIE5_CMLP1IE_LENGTH                      equ 0001h
PIE5_CMLP1IE_MASK                        equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 009Ch
// bitfield definitions
PIE6_ADIE_POSN                           equ 0000h
PIE6_ADIE_POSITION                       equ 0000h
PIE6_ADIE_SIZE                           equ 0001h
PIE6_ADIE_LENGTH                         equ 0001h
PIE6_ADIE_MASK                           equ 0001h
PIE6_ADTIE_POSN                          equ 0001h
PIE6_ADTIE_POSITION                      equ 0001h
PIE6_ADTIE_SIZE                          equ 0001h
PIE6_ADTIE_LENGTH                        equ 0001h
PIE6_ADTIE_MASK                          equ 0002h
PIE6_ZCDIE_POSN                          equ 0002h
PIE6_ZCDIE_POSITION                      equ 0002h
PIE6_ZCDIE_SIZE                          equ 0001h
PIE6_ZCDIE_LENGTH                        equ 0001h
PIE6_ZCDIE_MASK                          equ 0004h
PIE6_IOCSRIE_POSN                        equ 0007h
PIE6_IOCSRIE_POSITION                    equ 0007h
PIE6_IOCSRIE_SIZE                        equ 0001h
PIE6_IOCSRIE_LENGTH                      equ 0001h
PIE6_IOCSRIE_MASK                        equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 009Dh
// bitfield definitions
PIE7_OPA1CIE_POSN                        equ 0000h
PIE7_OPA1CIE_POSITION                    equ 0000h
PIE7_OPA1CIE_SIZE                        equ 0001h
PIE7_OPA1CIE_LENGTH                      equ 0001h
PIE7_OPA1CIE_MASK                        equ 0001h
PIE7_OPA2CIE_POSN                        equ 0001h
PIE7_OPA2CIE_POSITION                    equ 0001h
PIE7_OPA2CIE_SIZE                        equ 0001h
PIE7_OPA2CIE_LENGTH                      equ 0001h
PIE7_OPA2CIE_MASK                        equ 0002h
PIE7_OPA3CIE_POSN                        equ 0002h
PIE7_OPA3CIE_POSITION                    equ 0002h
PIE7_OPA3CIE_SIZE                        equ 0001h
PIE7_OPA3CIE_LENGTH                      equ 0001h
PIE7_OPA3CIE_MASK                        equ 0004h

