garyPenhook/PIC-Assembler/device_includes/pic16f17556.inc
// Register: CM1NCH
#define CM1NCH CM1NCH
CM1NCH                                   equ 080Eh
// bitfield definitions
CM1NCH_NCH_POSN                          equ 0000h
CM1NCH_NCH_POSITION                      equ 0000h
CM1NCH_NCH_SIZE                          equ 0003h
CM1NCH_NCH_LENGTH                        equ 0003h
CM1NCH_NCH_MASK                          equ 0007h
CM1NCH_NCH0_POSN                         equ 0000h
CM1NCH_NCH0_POSITION                     equ 0000h
CM1NCH_NCH0_SIZE                         equ 0001h
CM1NCH_NCH0_LENGTH                       equ 0001h
CM1NCH_NCH0_MASK                         equ 0001h
CM1NCH_NCH1_POSN                         equ 0001h
CM1NCH_NCH1_POSITION                     equ 0001h
CM1NCH_NCH1_SIZE                         equ 0001h
CM1NCH_NCH1_LENGTH                       equ 0001h
CM1NCH_NCH1_MASK                         equ 0002h
CM1NCH_NCH2_POSN                         equ 0002h
CM1NCH_NCH2_POSITION                     equ 0002h
CM1NCH_NCH2_SIZE                         equ 0001h
CM1NCH_NCH2_LENGTH                       equ 0001h
CM1NCH_NCH2_MASK                         equ 0004h
CM1NCH_C1NCH0_POSN                       equ 0000h
CM1NCH_C1NCH0_POSITION                   equ 0000h
CM1NCH_C1NCH0_SIZE                       equ 0001h
CM1NCH_C1NCH0_LENGTH                     equ 0001h
CM1NCH_C1NCH0_MASK                       equ 0001h
CM1NCH_C1NCH1_POSN                       equ 0001h
CM1NCH_C1NCH1_POSITION                   equ 0001h
CM1NCH_C1NCH1_SIZE                       equ 0001h
CM1NCH_C1NCH1_LENGTH                     equ 0001h
CM1NCH_C1NCH1_MASK                       equ 0002h
CM1NCH_C1NCH2_POSN                       equ 0002h
CM1NCH_C1NCH2_POSITION                   equ 0002h
CM1NCH_C1NCH2_SIZE                       equ 0001h
CM1NCH_C1NCH2_LENGTH                     equ 0001h
CM1NCH_C1NCH2_MASK                       equ 0004h

// Register: CM1PCH
#define CM1PCH CM1PCH
CM1PCH                                   equ 080Fh
// bitfield definitions
CM1PCH_PCH_POSN                          equ 0000h
CM1PCH_PCH_POSITION                      equ 0000h
CM1PCH_PCH_SIZE                          equ 0003h
CM1PCH_PCH_LENGTH                        equ 0003h
CM1PCH_PCH_MASK                          equ 0007h
CM1PCH_PCH0_POSN                         equ 0000h
CM1PCH_PCH0_POSITION                     equ 0000h
CM1PCH_PCH0_SIZE                         equ 0001h
CM1PCH_PCH0_LENGTH                       equ 0001h
CM1PCH_PCH0_MASK                         equ 0001h
CM1PCH_PCH1_POSN                         equ 0001h
CM1PCH_PCH1_POSITION                     equ 0001h
CM1PCH_PCH1_SIZE                         equ 0001h
CM1PCH_PCH1_LENGTH                       equ 0001h
CM1PCH_PCH1_MASK                         equ 0002h
CM1PCH_PCH2_POSN                         equ 0002h
CM1PCH_PCH2_POSITION                     equ 0002h
CM1PCH_PCH2_SIZE                         equ 0001h
CM1PCH_PCH2_LENGTH                       equ 0001h
CM1PCH_PCH2_MASK                         equ 0004h
CM1PCH_C1PCH0_POSN                       equ 0000h
CM1PCH_C1PCH0_POSITION                   equ 0000h
CM1PCH_C1PCH0_SIZE                       equ 0001h
CM1PCH_C1PCH0_LENGTH                     equ 0001h
CM1PCH_C1PCH0_MASK                       equ 0001h
CM1PCH_C1PCH1_POSN                       equ 0001h
CM1PCH_C1PCH1_POSITION                   equ 0001h
CM1PCH_C1PCH1_SIZE                       equ 0001h
CM1PCH_C1PCH1_LENGTH                     equ 0001h
CM1PCH_C1PCH1_MASK                       equ 0002h
CM1PCH_C1PCH2_POSN                       equ 0002h
CM1PCH_C1PCH2_POSITION                   equ 0002h
CM1PCH_C1PCH2_SIZE                       equ 0001h
CM1PCH_C1PCH2_LENGTH                     equ 0001h
CM1PCH_C1PCH2_MASK                       equ 0004h

// Register: CMLP1CON0
#define CMLP1CON0 CMLP1CON0
CMLP1CON0                                equ 0810h
// bitfield definitions
CMLP1CON0_SYNC_POSN                      equ 0000h
CMLP1CON0_SYNC_POSITION                  equ 0000h
CMLP1CON0_SYNC_SIZE                      equ 0001h
CMLP1CON0_SYNC_LENGTH                    equ 0001h
CMLP1CON0_SYNC_MASK                      equ 0001h
CMLP1CON0_POL_POSN                       equ 0004h
CMLP1CON0_POL_POSITION                   equ 0004h
CMLP1CON0_POL_SIZE                       equ 0001h
CMLP1CON0_POL_LENGTH                     equ 0001h
CMLP1CON0_POL_MASK                       equ 0010h
CMLP1CON0_OUT_POSN                       equ 0006h
CMLP1CON0_OUT_POSITION                   equ 0006h
CMLP1CON0_OUT_SIZE                       equ 0001h
CMLP1CON0_OUT_LENGTH                     equ 0001h
CMLP1CON0_OUT_MASK                       equ 0040h
CMLP1CON0_EN_POSN                        equ 0007h
CMLP1CON0_EN_POSITION                    equ 0007h
CMLP1CON0_EN_SIZE                        equ 0001h
CMLP1CON0_EN_LENGTH                      equ 0001h
CMLP1CON0_EN_MASK                        equ 0080h
CMLP1CON0_CLP1SYNC_POSN                  equ 0000h
CMLP1CON0_CLP1SYNC_POSITION              equ 0000h
CMLP1CON0_CLP1SYNC_SIZE                  equ 0001h
CMLP1CON0_CLP1SYNC_LENGTH                equ 0001h
CMLP1CON0_CLP1SYNC_MASK                  equ 0001h
CMLP1CON0_CLP1POL_POSN                   equ 0004h
CMLP1CON0_CLP1POL_POSITION               equ 0004h
CMLP1CON0_CLP1POL_SIZE                   equ 0001h
CMLP1CON0_CLP1POL_LENGTH                 equ 0001h
CMLP1CON0_CLP1POL_MASK                   equ 0010h
CMLP1CON0_CLP1OUT_POSN                   equ 0006h
CMLP1CON0_CLP1OUT_POSITION               equ 0006h
CMLP1CON0_CLP1OUT_SIZE                   equ 0001h
CMLP1CON0_CLP1OUT_LENGTH                 equ 0001h
CMLP1CON0_CLP1OUT_MASK                   equ 0040h
CMLP1CON0_CLP1EN_POSN                    equ 0007h
CMLP1CON0_CLP1EN_POSITION                equ 0007h
CMLP1CON0_CLP1EN_SIZE                    equ 0001h
CMLP1CON0_CLP1EN_LENGTH                  equ 0001h
CMLP1CON0_CLP1EN_MASK                    equ 0080h

// Register: CMLP1CON1
#define CMLP1CON1 CMLP1CON1
CMLP1CON1                                equ 0811h
// bitfield definitions
CMLP1CON1_INTN_POSN                      equ 0000h
CMLP1CON1_INTN_POSITION                  equ 0000h
CMLP1CON1_INTN_SIZE                      equ 0001h
CMLP1CON1_INTN_LENGTH                    equ 0001h
CMLP1CON1_INTN_MASK                      equ 0001h
CMLP1CON1_INTP_POSN                      equ 0001h
CMLP1CON1_INTP_POSITION                  equ 0001h
CMLP1CON1_INTP_SIZE                      equ 0001h
CMLP1CON1_INTP_LENGTH                    equ 0001h
CMLP1CON1_INTP_MASK                      equ 0002h
CMLP1CON1_CMR_POSN                       equ 0004h
CMLP1CON1_CMR_POSITION                   equ 0004h
CMLP1CON1_CMR_SIZE                       equ 0002h
CMLP1CON1_CMR_LENGTH                     equ 0002h
CMLP1CON1_CMR_MASK                       equ 0030h
CMLP1CON1_CLP1INTN_POSN                  equ 0000h
CMLP1CON1_CLP1INTN_POSITION              equ 0000h
CMLP1CON1_CLP1INTN_SIZE                  equ 0001h
CMLP1CON1_CLP1INTN_LENGTH                equ 0001h
CMLP1CON1_CLP1INTN_MASK                  equ 0001h
CMLP1CON1_CLP1INTP_POSN                  equ 0001h
CMLP1CON1_CLP1INTP_POSITION              equ 0001h
CMLP1CON1_CLP1INTP_SIZE                  equ 0001h
CMLP1CON1_CLP1INTP_LENGTH                equ 0001h
CMLP1CON1_CLP1INTP_MASK                  equ 0002h
CMLP1CON1_CLP1CMR_POSN                   equ 0004h
CMLP1CON1_CLP1CMR_POSITION               equ 0004h
CMLP1CON1_CLP1CMR_SIZE                   equ 0002h
CMLP1CON1_CLP1CMR_LENGTH                 equ 0002h
CMLP1CON1_CLP1CMR_MASK                   equ 0030h
CMLP1CON1_CMR0_POSN                      equ 0004h
CMLP1CON1_CMR0_POSITION                  equ 0004h
CMLP1CON1_CMR0_SIZE                      equ 0001h
CMLP1CON1_CMR0_LENGTH                    equ 0001h
CMLP1CON1_CMR0_MASK                      equ 0010h
CMLP1CON1_CMR1_POSN                      equ 0005h
CMLP1CON1_CMR1_POSITION                  equ 0005h
CMLP1CON1_CMR1_SIZE                      equ 0001h
CMLP1CON1_CMR1_LENGTH                    equ 0001h
CMLP1CON1_CMR1_MASK                      equ 0020h
CMLP1CON1_CLP1CMR0_POSN                  equ 0004h
CMLP1CON1_CLP1CMR0_POSITION              equ 0004h
CMLP1CON1_CLP1CMR0_SIZE                  equ 0001h
CMLP1CON1_CLP1CMR0_LENGTH                equ 0001h
CMLP1CON1_CLP1CMR0_MASK                  equ 0010h
CMLP1CON1_CLP1CMR1_POSN                  equ 0005h
CMLP1CON1_CLP1CMR1_POSITION              equ 0005h
CMLP1CON1_CLP1CMR1_SIZE                  equ 0001h
CMLP1CON1_CLP1CMR1_LENGTH                equ 0001h
CMLP1CON1_CLP1CMR1_MASK                  equ 0020h

// Register: CMLP1NCH
#define CMLP1NCH CMLP1NCH
CMLP1NCH                                 equ 0812h
// bitfield definitions
CMLP1NCH_NCH_POSN                        equ 0000h
CMLP1NCH_NCH_POSITION                    equ 0000h
CMLP1NCH_NCH_SIZE                        equ 0003h
CMLP1NCH_NCH_LENGTH                      equ 0003h
CMLP1NCH_NCH_MASK                        equ 0007h
CMLP1NCH_NCH0_POSN                       equ 0000h
CMLP1NCH_NCH0_POSITION                   equ 0000h
CMLP1NCH_NCH0_SIZE                       equ 0001h
CMLP1NCH_NCH0_LENGTH                     equ 0001h
CMLP1NCH_NCH0_MASK                       equ 0001h
CMLP1NCH_NCH1_POSN                       equ 0001h
CMLP1NCH_NCH1_POSITION                   equ 0001h
CMLP1NCH_NCH1_SIZE                       equ 0001h
CMLP1NCH_NCH1_LENGTH                     equ 0001h
CMLP1NCH_NCH1_MASK                       equ 0002h
CMLP1NCH_NCH2_POSN                       equ 0002h
CMLP1NCH_NCH2_POSITION                   equ 0002h
CMLP1NCH_NCH2_SIZE                       equ 0001h
CMLP1NCH_NCH2_LENGTH                     equ 0001h
CMLP1NCH_NCH2_MASK                       equ 0004h
CMLP1NCH_CLP1NCH0_POSN                   equ 0000h
CMLP1NCH_CLP1NCH0_POSITION               equ 0000h
CMLP1NCH_CLP1NCH0_SIZE                   equ 0001h
CMLP1NCH_CLP1NCH0_LENGTH                 equ 0001h
CMLP1NCH_CLP1NCH0_MASK                   equ 0001h
CMLP1NCH_CLP1NCH1_POSN                   equ 0001h
CMLP1NCH_CLP1NCH1_POSITION               equ 0001h
CMLP1NCH_CLP1NCH1_SIZE                   equ 0001h
CMLP1NCH_CLP1NCH1_LENGTH                 equ 0001h
CMLP1NCH_CLP1NCH1_MASK                   equ 0002h
CMLP1NCH_CLP1NCH2_POSN                   equ 0002h
CMLP1NCH_CLP1NCH2_POSITION               equ 0002h
CMLP1NCH_CLP1NCH2_SIZE                   equ 0001h
CMLP1NCH_CLP1NCH2_LENGTH                 equ 0001h
CMLP1NCH_CLP1NCH2_MASK                   equ 0004h

// Register: CMLP1PCH
#define CMLP1PCH CMLP1PCH
CMLP1PCH                                 equ 0813h
// bitfield definitions
CMLP1PCH_PCH_POSN                        equ 0000h
CMLP1PCH_PCH_POSITION                    equ 0000h
CMLP1PCH_PCH_SIZE                        equ 0003h
CMLP1PCH_PCH_LENGTH                      equ 0003h
CMLP1PCH_PCH_MASK                        equ 0007h
CMLP1PCH_PCH0_POSN                       equ 0000h
CMLP1PCH_PCH0_POSITION                   equ 0000h
CMLP1PCH_PCH0_SIZE                       equ 0001h
CMLP1PCH_PCH0_LENGTH                     equ 0001h
CMLP1PCH_PCH0_MASK                       equ 0001h
CMLP1PCH_PCH1_POSN                       equ 0001h
CMLP1PCH_PCH1_POSITION                   equ 0001h
CMLP1PCH_PCH1_SIZE                       equ 0001h
CMLP1PCH_PCH1_LENGTH                     equ 0001h
CMLP1PCH_PCH1_MASK                       equ 0002h
CMLP1PCH_PCH2_POSN                       equ 0002h
CMLP1PCH_PCH2_POSITION                   equ 0002h
CMLP1PCH_PCH2_SIZE                       equ 0001h
CMLP1PCH_PCH2_LENGTH                     equ 0001h
CMLP1PCH_PCH2_MASK                       equ 0004h
CMLP1PCH_CLP1PCH0_POSN                   equ 0000h
CMLP1PCH_CLP1PCH0_POSITION               equ 0000h
CMLP1PCH_CLP1PCH0_SIZE                   equ 0001h
CMLP1PCH_CLP1PCH0_LENGTH                 equ 0001h
CMLP1PCH_CLP1PCH0_MASK                   equ 0001h
CMLP1PCH_CLP1PCH1_POSN                   equ 0001h
CMLP1PCH_CLP1PCH1_POSITION               equ 0001h
CMLP1PCH_CLP1PCH1_SIZE                   equ 0001h
CMLP1PCH_CLP1PCH1_LENGTH                 equ 0001h
CMLP1PCH_CLP1PCH1_MASK                   equ 0002h
CMLP1PCH_CLP1PCH2_POSN                   equ 0002h
CMLP1PCH_CLP1PCH2_POSITION               equ 0002h
CMLP1PCH_CLP1PCH2_SIZE                   equ 0001h
CMLP1PCH_CLP1PCH2_LENGTH                 equ 0001h
CMLP1PCH_CLP1PCH2_MASK                   equ 0004h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 081Fh
// bitfield definitions
CMOUT_C1OUT_POSN                         equ 0000h
CMOUT_C1OUT_POSITION                     equ 0000h
CMOUT_C1OUT_SIZE                         equ 0001h
CMOUT_C1OUT_LENGTH                       equ 0001h
CMOUT_C1OUT_MASK                         equ 0001h
CMOUT_CLP1OUT_POSN                       equ 0001h
CMOUT_CLP1OUT_POSITION                   equ 0001h
CMOUT_CLP1OUT_SIZE                       equ 0001h
CMOUT_CLP1OUT_LENGTH                     equ 0001h
CMOUT_CLP1OUT_MASK                       equ 0002h

