garyPenhook/PIC-Assembler/device_includes/pic16f17556.inc
// Register: OPA3CON0
#define OPA3CON0 OPA3CON0
OPA3CON0                                 equ 0B0Ch
// bitfield definitions
OPA3CON0_UG_POSN                         equ 0003h
OPA3CON0_UG_POSITION                     equ 0003h
OPA3CON0_UG_SIZE                         equ 0001h
OPA3CON0_UG_LENGTH                       equ 0001h
OPA3CON0_UG_MASK                         equ 0008h
OPA3CON0_EN_POSN                         equ 0007h
OPA3CON0_EN_POSITION                     equ 0007h
OPA3CON0_EN_SIZE                         equ 0001h
OPA3CON0_EN_LENGTH                       equ 0001h
OPA3CON0_EN_MASK                         equ 0080h
OPA3CON0_UG0_POSN                        equ 0003h
OPA3CON0_UG0_POSITION                    equ 0003h
OPA3CON0_UG0_SIZE                        equ 0001h
OPA3CON0_UG0_LENGTH                      equ 0001h
OPA3CON0_UG0_MASK                        equ 0008h
OPA3CON0_OPA3UG_POSN                     equ 0003h
OPA3CON0_OPA3UG_POSITION                 equ 0003h
OPA3CON0_OPA3UG_SIZE                     equ 0001h
OPA3CON0_OPA3UG_LENGTH                   equ 0001h
OPA3CON0_OPA3UG_MASK                     equ 0008h
OPA3CON0_OPA3EN_POSN                     equ 0007h
OPA3CON0_OPA3EN_POSITION                 equ 0007h
OPA3CON0_OPA3EN_SIZE                     equ 0001h
OPA3CON0_OPA3EN_LENGTH                   equ 0001h
OPA3CON0_OPA3EN_MASK                     equ 0080h

// Register: OPA3CON2
#define OPA3CON2 OPA3CON2
OPA3CON2                                 equ 0B0Dh
// bitfield definitions
OPA3CON2_PCH_POSN                        equ 0000h
OPA3CON2_PCH_POSITION                    equ 0000h
OPA3CON2_PCH_SIZE                        equ 0004h
OPA3CON2_PCH_LENGTH                      equ 0004h
OPA3CON2_PCH_MASK                        equ 000Fh
OPA3CON2_PCH0_POSN                       equ 0000h
OPA3CON2_PCH0_POSITION                   equ 0000h
OPA3CON2_PCH0_SIZE                       equ 0001h
OPA3CON2_PCH0_LENGTH                     equ 0001h
OPA3CON2_PCH0_MASK                       equ 0001h
OPA3CON2_PCH1_POSN                       equ 0001h
OPA3CON2_PCH1_POSITION                   equ 0001h
OPA3CON2_PCH1_SIZE                       equ 0001h
OPA3CON2_PCH1_LENGTH                     equ 0001h
OPA3CON2_PCH1_MASK                       equ 0002h
OPA3CON2_PCH2_POSN                       equ 0002h
OPA3CON2_PCH2_POSITION                   equ 0002h
OPA3CON2_PCH2_SIZE                       equ 0001h
OPA3CON2_PCH2_LENGTH                     equ 0001h
OPA3CON2_PCH2_MASK                       equ 0004h
OPA3CON2_OPA3PCH_POSN                    equ 0000h
OPA3CON2_OPA3PCH_POSITION                equ 0000h
OPA3CON2_OPA3PCH_SIZE                    equ 0004h
OPA3CON2_OPA3PCH_LENGTH                  equ 0004h
OPA3CON2_OPA3PCH_MASK                    equ 000Fh
OPA3CON2_OPA3PCH0_POSN                   equ 0000h
OPA3CON2_OPA3PCH0_POSITION               equ 0000h
OPA3CON2_OPA3PCH0_SIZE                   equ 0001h
OPA3CON2_OPA3PCH0_LENGTH                 equ 0001h
OPA3CON2_OPA3PCH0_MASK                   equ 0001h
OPA3CON2_OPA3PCH1_POSN                   equ 0001h
OPA3CON2_OPA3PCH1_POSITION               equ 0001h
OPA3CON2_OPA3PCH1_SIZE                   equ 0001h
OPA3CON2_OPA3PCH1_LENGTH                 equ 0001h
OPA3CON2_OPA3PCH1_MASK                   equ 0002h
OPA3CON2_OPA3PCH2_POSN                   equ 0002h
OPA3CON2_OPA3PCH2_POSITION               equ 0002h
OPA3CON2_OPA3PCH2_SIZE                   equ 0001h
OPA3CON2_OPA3PCH2_LENGTH                 equ 0001h
OPA3CON2_OPA3PCH2_MASK                   equ 0004h

// Register: OPA3CON3
#define OPA3CON3 OPA3CON3
OPA3CON3                                 equ 0B0Eh
// bitfield definitions
OPA3CON3_NCH_POSN                        equ 0000h
OPA3CON3_NCH_POSITION                    equ 0000h
OPA3CON3_NCH_SIZE                        equ 0005h
OPA3CON3_NCH_LENGTH                      equ 0005h
OPA3CON3_NCH_MASK                        equ 001Fh
OPA3CON3_NCH0_POSN                       equ 0000h
OPA3CON3_NCH0_POSITION                   equ 0000h
OPA3CON3_NCH0_SIZE                       equ 0001h
OPA3CON3_NCH0_LENGTH                     equ 0001h
OPA3CON3_NCH0_MASK                       equ 0001h
OPA3CON3_NCH1_POSN                       equ 0001h
OPA3CON3_NCH1_POSITION                   equ 0001h
OPA3CON3_NCH1_SIZE                       equ 0001h
OPA3CON3_NCH1_LENGTH                     equ 0001h
OPA3CON3_NCH1_MASK                       equ 0002h
OPA3CON3_NCH2_POSN                       equ 0002h
OPA3CON3_NCH2_POSITION                   equ 0002h
OPA3CON3_NCH2_SIZE                       equ 0001h
OPA3CON3_NCH2_LENGTH                     equ 0001h
OPA3CON3_NCH2_MASK                       equ 0004h
OPA3CON3_OPA3NCH_POSN                    equ 0000h
OPA3CON3_OPA3NCH_POSITION                equ 0000h
OPA3CON3_OPA3NCH_SIZE                    equ 0005h
OPA3CON3_OPA3NCH_LENGTH                  equ 0005h
OPA3CON3_OPA3NCH_MASK                    equ 001Fh
OPA3CON3_OPA3NCH0_POSN                   equ 0000h
OPA3CON3_OPA3NCH0_POSITION               equ 0000h
OPA3CON3_OPA3NCH0_SIZE                   equ 0001h
OPA3CON3_OPA3NCH0_LENGTH                 equ 0001h
OPA3CON3_OPA3NCH0_MASK                   equ 0001h
OPA3CON3_OPA3NCH1_POSN                   equ 0001h
OPA3CON3_OPA3NCH1_POSITION               equ 0001h
OPA3CON3_OPA3NCH1_SIZE                   equ 0001h
OPA3CON3_OPA3NCH1_LENGTH                 equ 0001h
OPA3CON3_OPA3NCH1_MASK                   equ 0002h
OPA3CON3_OPA3NCH2_POSN                   equ 0002h
OPA3CON3_OPA3NCH2_POSITION               equ 0002h
OPA3CON3_OPA3NCH2_SIZE                   equ 0001h
OPA3CON3_OPA3NCH2_LENGTH                 equ 0001h
OPA3CON3_OPA3NCH2_MASK                   equ 0004h

// Register: OPA3OFFSET
#define OPA3OFFSET OPA3OFFSET
OPA3OFFSET                               equ 0B0Fh
// bitfield definitions
OPA3OFFSET_OFFSET_POSN                   equ 0000h
OPA3OFFSET_OFFSET_POSITION               equ 0000h
OPA3OFFSET_OFFSET_SIZE                   equ 0008h
OPA3OFFSET_OFFSET_LENGTH                 equ 0008h
OPA3OFFSET_OFFSET_MASK                   equ 00FFh
OPA3OFFSET_OFFSET0_POSN                  equ 0000h
OPA3OFFSET_OFFSET0_POSITION              equ 0000h
OPA3OFFSET_OFFSET0_SIZE                  equ 0001h
OPA3OFFSET_OFFSET0_LENGTH                equ 0001h
OPA3OFFSET_OFFSET0_MASK                  equ 0001h
OPA3OFFSET_OFFSET1_POSN                  equ 0001h
OPA3OFFSET_OFFSET1_POSITION              equ 0001h
OPA3OFFSET_OFFSET1_SIZE                  equ 0001h
OPA3OFFSET_OFFSET1_LENGTH                equ 0001h
OPA3OFFSET_OFFSET1_MASK                  equ 0002h
OPA3OFFSET_OFFSET2_POSN                  equ 0002h
OPA3OFFSET_OFFSET2_POSITION              equ 0002h
OPA3OFFSET_OFFSET2_SIZE                  equ 0001h
OPA3OFFSET_OFFSET2_LENGTH                equ 0001h
OPA3OFFSET_OFFSET2_MASK                  equ 0004h
OPA3OFFSET_OFFSET3_POSN                  equ 0003h
OPA3OFFSET_OFFSET3_POSITION              equ 0003h
OPA3OFFSET_OFFSET3_SIZE                  equ 0001h
OPA3OFFSET_OFFSET3_LENGTH                equ 0001h
OPA3OFFSET_OFFSET3_MASK                  equ 0008h
OPA3OFFSET_OFFSET4_POSN                  equ 0004h
OPA3OFFSET_OFFSET4_POSITION              equ 0004h
OPA3OFFSET_OFFSET4_SIZE                  equ 0001h
OPA3OFFSET_OFFSET4_LENGTH                equ 0001h
OPA3OFFSET_OFFSET4_MASK                  equ 0010h
OPA3OFFSET_OFFSET5_POSN                  equ 0005h
OPA3OFFSET_OFFSET5_POSITION              equ 0005h
OPA3OFFSET_OFFSET5_SIZE                  equ 0001h
OPA3OFFSET_OFFSET5_LENGTH                equ 0001h
OPA3OFFSET_OFFSET5_MASK                  equ 0020h
OPA3OFFSET_OFFSET6_POSN                  equ 0006h
OPA3OFFSET_OFFSET6_POSITION              equ 0006h
OPA3OFFSET_OFFSET6_SIZE                  equ 0001h
OPA3OFFSET_OFFSET6_LENGTH                equ 0001h
OPA3OFFSET_OFFSET6_MASK                  equ 0040h
OPA3OFFSET_OFFSET7_POSN                  equ 0007h
OPA3OFFSET_OFFSET7_POSITION              equ 0007h
OPA3OFFSET_OFFSET7_SIZE                  equ 0001h
OPA3OFFSET_OFFSET7_LENGTH                equ 0001h
OPA3OFFSET_OFFSET7_MASK                  equ 0080h
OPA3OFFSET_OPA3OFFSET_POSN               equ 0000h
OPA3OFFSET_OPA3OFFSET_POSITION           equ 0000h
OPA3OFFSET_OPA3OFFSET_SIZE               equ 0008h
OPA3OFFSET_OPA3OFFSET_LENGTH             equ 0008h
OPA3OFFSET_OPA3OFFSET_MASK               equ 00FFh
OPA3OFFSET_OPA3OFFSET0_POSN              equ 0000h
OPA3OFFSET_OPA3OFFSET0_POSITION          equ 0000h
OPA3OFFSET_OPA3OFFSET0_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET0_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET0_MASK              equ 0001h
OPA3OFFSET_OPA3OFFSET1_POSN              equ 0001h
OPA3OFFSET_OPA3OFFSET1_POSITION          equ 0001h
OPA3OFFSET_OPA3OFFSET1_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET1_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET1_MASK              equ 0002h
OPA3OFFSET_OPA3OFFSET2_POSN              equ 0002h
OPA3OFFSET_OPA3OFFSET2_POSITION          equ 0002h
OPA3OFFSET_OPA3OFFSET2_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET2_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET2_MASK              equ 0004h
OPA3OFFSET_OPA3OFFSET3_POSN              equ 0003h
OPA3OFFSET_OPA3OFFSET3_POSITION          equ 0003h
OPA3OFFSET_OPA3OFFSET3_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET3_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET3_MASK              equ 0008h
OPA3OFFSET_OPA3OFFSET4_POSN              equ 0004h
OPA3OFFSET_OPA3OFFSET4_POSITION          equ 0004h
OPA3OFFSET_OPA3OFFSET4_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET4_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET4_MASK              equ 0010h
OPA3OFFSET_OPA3OFFSET5_POSN              equ 0005h
OPA3OFFSET_OPA3OFFSET5_POSITION          equ 0005h
OPA3OFFSET_OPA3OFFSET5_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET5_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET5_MASK              equ 0020h
OPA3OFFSET_OPA3OFFSET6_POSN              equ 0006h
OPA3OFFSET_OPA3OFFSET6_POSITION          equ 0006h
OPA3OFFSET_OPA3OFFSET6_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET6_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET6_MASK              equ 0040h
OPA3OFFSET_OPA3OFFSET7_POSN              equ 0007h
OPA3OFFSET_OPA3OFFSET7_POSITION          equ 0007h
OPA3OFFSET_OPA3OFFSET7_SIZE              equ 0001h
OPA3OFFSET_OPA3OFFSET7_LENGTH            equ 0001h
OPA3OFFSET_OPA3OFFSET7_MASK              equ 0080h

// Register: OPA3CON4
#define OPA3CON4 OPA3CON4
OPA3CON4                                 equ 0B10h
// bitfield definitions
OPA3CON4_OFCSEL_POSN                     equ 0000h
OPA3CON4_OFCSEL_POSITION                 equ 0000h
OPA3CON4_OFCSEL_SIZE                     equ 0002h
OPA3CON4_OFCSEL_LENGTH                   equ 0002h
OPA3CON4_OFCSEL_MASK                     equ 0003h
OPA3CON4_OFCST_POSN                      equ 0002h
OPA3CON4_OFCST_POSITION                  equ 0002h
OPA3CON4_OFCST_SIZE                      equ 0001h
OPA3CON4_OFCST_LENGTH                    equ 0001h
OPA3CON4_OFCST_MASK                      equ 0004h
OPA3CON4_OFCSEL0_POSN                    equ 0000h
OPA3CON4_OFCSEL0_POSITION                equ 0000h
OPA3CON4_OFCSEL0_SIZE                    equ 0001h
OPA3CON4_OFCSEL0_LENGTH                  equ 0001h
OPA3CON4_OFCSEL0_MASK                    equ 0001h
OPA3CON4_OFCSEL1_POSN                    equ 0001h
OPA3CON4_OFCSEL1_POSITION                equ 0001h
OPA3CON4_OFCSEL1_SIZE                    equ 0001h
OPA3CON4_OFCSEL1_LENGTH                  equ 0001h
OPA3CON4_OFCSEL1_MASK                    equ 0002h
OPA3CON4_OPA3OFCSEL_POSN                 equ 0000h
OPA3CON4_OPA3OFCSEL_POSITION             equ 0000h
OPA3CON4_OPA3OFCSEL_SIZE                 equ 0002h
OPA3CON4_OPA3OFCSEL_LENGTH               equ 0002h
OPA3CON4_OPA3OFCSEL_MASK                 equ 0003h
OPA3CON4_OPA3OFCST_POSN                  equ 0002h
OPA3CON4_OPA3OFCST_POSITION              equ 0002h
OPA3CON4_OPA3OFCST_SIZE                  equ 0001h
OPA3CON4_OPA3OFCST_LENGTH                equ 0001h
OPA3CON4_OPA3OFCST_MASK                  equ 0004h
OPA3CON4_OPA3OFCSEL0_POSN                equ 0000h
OPA3CON4_OPA3OFCSEL0_POSITION            equ 0000h
OPA3CON4_OPA3OFCSEL0_SIZE                equ 0001h
OPA3CON4_OPA3OFCSEL0_LENGTH              equ 0001h
OPA3CON4_OPA3OFCSEL0_MASK                equ 0001h
OPA3CON4_OPA3OFCSEL1_POSN                equ 0001h
OPA3CON4_OPA3OFCSEL1_POSITION            equ 0001h
OPA3CON4_OPA3OFCSEL1_SIZE                equ 0001h
OPA3CON4_OPA3OFCSEL1_LENGTH              equ 0001h
OPA3CON4_OPA3OFCSEL1_MASK                equ 0002h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 01C8Ch
// bitfield definitions
NVMADRL_NVMADR_POSN                      equ 0000h
NVMADRL_NVMADR_POSITION                  equ 0000h
NVMADRL_NVMADR_SIZE                      equ 0008h
NVMADRL_NVMADR_LENGTH                    equ 0008h
NVMADRL_NVMADR_MASK                      equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

