garyPenhook/PIC-Assembler/device_includes/pic16f17556.inc
// Register: ADCLK
#define ADCLK ADCLK
ADCLK                                    equ 01D2Dh
// bitfield definitions
ADCLK_CS_POSN                            equ 0000h
ADCLK_CS_POSITION                        equ 0000h
ADCLK_CS_SIZE                            equ 0006h
ADCLK_CS_LENGTH                          equ 0006h
ADCLK_CS_MASK                            equ 003Fh
ADCLK_OSC_POSN                           equ 0006h
ADCLK_OSC_POSITION                       equ 0006h
ADCLK_OSC_SIZE                           equ 0002h
ADCLK_OSC_LENGTH                         equ 0002h
ADCLK_OSC_MASK                           equ 00C0h
ADCLK_ADCS0_POSN                         equ 0000h
ADCLK_ADCS0_POSITION                     equ 0000h
ADCLK_ADCS0_SIZE                         equ 0001h
ADCLK_ADCS0_LENGTH                       equ 0001h
ADCLK_ADCS0_MASK                         equ 0001h
ADCLK_ADCS1_POSN                         equ 0001h
ADCLK_ADCS1_POSITION                     equ 0001h
ADCLK_ADCS1_SIZE                         equ 0001h
ADCLK_ADCS1_LENGTH                       equ 0001h
ADCLK_ADCS1_MASK                         equ 0002h
ADCLK_ADCS2_POSN                         equ 0002h
ADCLK_ADCS2_POSITION                     equ 0002h
ADCLK_ADCS2_SIZE                         equ 0001h
ADCLK_ADCS2_LENGTH                       equ 0001h
ADCLK_ADCS2_MASK                         equ 0004h
ADCLK_ADCS3_POSN                         equ 0003h
ADCLK_ADCS3_POSITION                     equ 0003h
ADCLK_ADCS3_SIZE                         equ 0001h
ADCLK_ADCS3_LENGTH                       equ 0001h
ADCLK_ADCS3_MASK                         equ 0008h
ADCLK_ADCS4_POSN                         equ 0004h
ADCLK_ADCS4_POSITION                     equ 0004h
ADCLK_ADCS4_SIZE                         equ 0001h
ADCLK_ADCS4_LENGTH                       equ 0001h
ADCLK_ADCS4_MASK                         equ 0010h
ADCLK_ADCS5_POSN                         equ 0005h
ADCLK_ADCS5_POSITION                     equ 0005h
ADCLK_ADCS5_SIZE                         equ 0001h
ADCLK_ADCS5_LENGTH                       equ 0001h
ADCLK_ADCS5_MASK                         equ 0020h
ADCLK_OSC0_POSN                          equ 0006h
ADCLK_OSC0_POSITION                      equ 0006h
ADCLK_OSC0_SIZE                          equ 0001h
ADCLK_OSC0_LENGTH                        equ 0001h
ADCLK_OSC0_MASK                          equ 0040h
ADCLK_OSC1_POSN                          equ 0007h
ADCLK_OSC1_POSITION                      equ 0007h
ADCLK_OSC1_SIZE                          equ 0001h
ADCLK_OSC1_LENGTH                        equ 0001h
ADCLK_OSC1_MASK                          equ 0080h
ADCLK_ADCS_POSN                          equ 0000h
ADCLK_ADCS_POSITION                      equ 0000h
ADCLK_ADCS_SIZE                          equ 0006h
ADCLK_ADCS_LENGTH                        equ 0006h
ADCLK_ADCS_MASK                          equ 003Fh
ADCLK_ADOSC_POSN                         equ 0006h
ADCLK_ADOSC_POSITION                     equ 0006h
ADCLK_ADOSC_SIZE                         equ 0002h
ADCLK_ADOSC_LENGTH                       equ 0002h
ADCLK_ADOSC_MASK                         equ 00C0h
ADCLK_CS0_POSN                           equ 0000h
ADCLK_CS0_POSITION                       equ 0000h
ADCLK_CS0_SIZE                           equ 0001h
ADCLK_CS0_LENGTH                         equ 0001h
ADCLK_CS0_MASK                           equ 0001h
ADCLK_CS1_POSN                           equ 0001h
ADCLK_CS1_POSITION                       equ 0001h
ADCLK_CS1_SIZE                           equ 0001h
ADCLK_CS1_LENGTH                         equ 0001h
ADCLK_CS1_MASK                           equ 0002h
ADCLK_CS2_POSN                           equ 0002h
ADCLK_CS2_POSITION                       equ 0002h
ADCLK_CS2_SIZE                           equ 0001h
ADCLK_CS2_LENGTH                         equ 0001h
ADCLK_CS2_MASK                           equ 0004h
ADCLK_CS3_POSN                           equ 0003h
ADCLK_CS3_POSITION                       equ 0003h
ADCLK_CS3_SIZE                           equ 0001h
ADCLK_CS3_LENGTH                         equ 0001h
ADCLK_CS3_MASK                           equ 0008h
ADCLK_CS4_POSN                           equ 0004h
ADCLK_CS4_POSITION                       equ 0004h
ADCLK_CS4_SIZE                           equ 0001h
ADCLK_CS4_LENGTH                         equ 0001h
ADCLK_CS4_MASK                           equ 0010h
ADCLK_CS5_POSN                           equ 0005h
ADCLK_CS5_POSITION                       equ 0005h
ADCLK_CS5_SIZE                           equ 0001h
ADCLK_CS5_LENGTH                         equ 0001h
ADCLK_CS5_MASK                           equ 0020h
ADCLK_ADOSC0_POSN                        equ 0006h
ADCLK_ADOSC0_POSITION                    equ 0006h
ADCLK_ADOSC0_SIZE                        equ 0001h
ADCLK_ADOSC0_LENGTH                      equ 0001h
ADCLK_ADOSC0_MASK                        equ 0040h
ADCLK_ADOSC1_POSN                        equ 0007h
ADCLK_ADOSC1_POSITION                    equ 0007h
ADCLK_ADOSC1_SIZE                        equ 0001h
ADCLK_ADOSC1_LENGTH                      equ 0001h
ADCLK_ADOSC1_MASK                        equ 0080h

// Register: ADCG1A
#define ADCG1A ADCG1A
ADCG1A                                   equ 01D2Eh
// bitfield definitions
ADCG1A_CGA0_POSN                         equ 0000h
ADCG1A_CGA0_POSITION                     equ 0000h
ADCG1A_CGA0_SIZE                         equ 0001h
ADCG1A_CGA0_LENGTH                       equ 0001h
ADCG1A_CGA0_MASK                         equ 0001h
ADCG1A_CGA1_POSN                         equ 0001h
ADCG1A_CGA1_POSITION                     equ 0001h
ADCG1A_CGA1_SIZE                         equ 0001h
ADCG1A_CGA1_LENGTH                       equ 0001h
ADCG1A_CGA1_MASK                         equ 0002h
ADCG1A_CGA2_POSN                         equ 0002h
ADCG1A_CGA2_POSITION                     equ 0002h
ADCG1A_CGA2_SIZE                         equ 0001h
ADCG1A_CGA2_LENGTH                       equ 0001h
ADCG1A_CGA2_MASK                         equ 0004h
ADCG1A_CGA3_POSN                         equ 0003h
ADCG1A_CGA3_POSITION                     equ 0003h
ADCG1A_CGA3_SIZE                         equ 0001h
ADCG1A_CGA3_LENGTH                       equ 0001h
ADCG1A_CGA3_MASK                         equ 0008h
ADCG1A_CGA4_POSN                         equ 0004h
ADCG1A_CGA4_POSITION                     equ 0004h
ADCG1A_CGA4_SIZE                         equ 0001h
ADCG1A_CGA4_LENGTH                       equ 0001h
ADCG1A_CGA4_MASK                         equ 0010h
ADCG1A_CGA5_POSN                         equ 0005h
ADCG1A_CGA5_POSITION                     equ 0005h
ADCG1A_CGA5_SIZE                         equ 0001h
ADCG1A_CGA5_LENGTH                       equ 0001h
ADCG1A_CGA5_MASK                         equ 0020h
ADCG1A_CGA6_POSN                         equ 0006h
ADCG1A_CGA6_POSITION                     equ 0006h
ADCG1A_CGA6_SIZE                         equ 0001h
ADCG1A_CGA6_LENGTH                       equ 0001h
ADCG1A_CGA6_MASK                         equ 0040h
ADCG1A_CGA7_POSN                         equ 0007h
ADCG1A_CGA7_POSITION                     equ 0007h
ADCG1A_CGA7_SIZE                         equ 0001h
ADCG1A_CGA7_LENGTH                       equ 0001h
ADCG1A_CGA7_MASK                         equ 0080h

